#include<stdio.h>//前置處理器的一種,將stdio檔案包含進去 
#include<stdlib.h>//前置處理器的一種,將stdlib檔案包含進去
int main(void)//主函數
{
	printf("---------------------------------------------\n");
	printf("---------------------------------------------\n");
	printf("---------------------------------------------\n");
	printf("---------------------------------------------\n");
    printf("---------------------------------------------\n");
	printf("EEEEEEEEEE      333333333            A       \n");
	printf("E                       3          A   A     \n");
	printf("E                       3         A     A    \n");
	printf("EEEEEEEEEE      333333333        AAAAAAAAA   \n");
	printf("E                       3       A         A  \n");
	printf("E                       3      A           A \n");
	printf("EEEEEEEEEE      333333333     A             A\n");
	printf("                                             \n");
	printf("       6666666666      777777777             \n");
	printf("       6               7       7             \n");
	printf("       6                       7             \n");
	printf("       6666666666              7             \n");
	printf("       6        6              7             \n");
	printf("       6        6              7             \n");
	printf("       6666666666              7             \n");
    printf("---------------------------------------------\n");
    printf("---------------------------------------------\n");
    printf("---------------------------------------------\n");
    printf("---------------------------------------------\n");
    printf("---------------------------------------------\n");//顯示個人畫面 
    system ("pause");//暫停程式執行,等待使用者按下任意鍵繼續 
    system("cls");//清除螢幕
    int x,i;//宣告整數變數 x,i
    while(i<3)//最多輸入3次 
	{
		printf("請輸入四個數字的密碼:");//提示使用者輸入四個字的密碼 
        scanf("%d",&x); //讀入使用者輸入的整數
		if(x!=2024)//若x不等於2024 
		{
			printf("輸入錯誤，請重新輸入\n");//顯示輸入錯誤，請重新輸入
			i++;
			if(i==3)//若輸入達三次 
			{
			  printf("輸入錯誤達三次，將結束程式\n");
			  return 0;	
			}
		}
		else//若x等於2024
		{
			break;//離開此迴圈
		}
	} 
    if(x==2024)//若x等於2024 
	{
		system("cls");//清除螢幕
		printf("--------------------------\n");
		printf("|a. 畫出直角三角形       |\n");
		printf("|b. 顯示乘法表           |\n");   
		printf("|c. 結束                 |\n");
		printf("--------------------------\n");
		printf("請輸入一個字元:\n");//要求使用者輸入一個字元 
		char ch;//宣告字元變數 
		if(ch=='a'||ch=='A')//若ch等於'a'或'A' 
		{
			system("cls");//清除螢幕
			printf("輸入一個'a'到'n'的字元:\n");//要求使用者輸入一個'a'到'n'的字元 
			
		}
		
	}
	
}
 
